const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', () => {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', () =>{
  expect(sum(2,5)).toBe(7)
})

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
test('10 + 1 เท่ากับ 11', () => {
  expect(sum(10,1)).toBe(11)
})

test('10 + 2 เท่ากับ 12', () => {
  expect(sum(10,2)).toBe(12)
})

test('10 + 3 เท่ากับ 13',() => {
  expect(sum(10,3)).toBe(13)
})